package a_datatype;

/*
 *  C언어의 문자 : Ascii_code
 *             -> 한글자를 1B(8bit)로 표현 그러므로 2(8) 총 256개 문자까지 표현
 *                         
 *  Java언어의 문자 : unicode(with Ascii_code를 포함)
 *             -> 한글자를 2B(16bit)로 표현 그러므로 2(16) 총 65535개 문자표현
 *             
 *  메모리단위 : 1bit : 0(off) / 1(on)
 *            8bit = 1byte
 *            1024byte = KB
 *            1024KB = 1MB
 *            1024MB = 1GB
 *            1024GB = 1TB
 * 
 *  [10진수]
 *  365 = 3*10(2자리) + 6*10(1자리) + 5*10(0자리)
 *      = 3*100 + 6*10 + 5
 *      = 300 + 60 + 5
 *      
 *  [2진수] 0,1
 *  11010 = 1*2(4) + 1*2(3) + 0*2(2) + 1*2(1) + 0*2(0)
 *        = 16 + 8 + 0 + 2 + 0 
 *        = 26
 *        
 *  [16진수] 0,1,2,3,4,5,6,7,8,9 + A,B,C,D,E,F
 *  6F = 6*16(1) + F*16(0)
 *     = 6*16 + 15*1
 *     = 96 + 15 
 *     = 111
 *                 
 * 
 */

public class Ex09_Ascii {

	public static void main(String[] args) {
		
		int a ; // int 는 4B짜리 정수
		a = 'a'; // 4B 변수에 2B 값 지정
		System.out.println(a);
		//[Ascii_code] 1B = 8bit
		//-----------------------
		//0100 0001 = A(대문자) = 1*2(6) + 1*2(0) = 64 + 1
		//0100 0010 = B
		//0100 0011 = C 
		//0110 0001 = a(소문자) = 1*2(6) + 1*2(5) + 1*2(0) = 64 + 32 + 1  
		//0110 0010 = b
		
		char ch = 70; //본래는 char ch = (char)70;
		System.out.println(ch);
		

	}

}
